Revit 2025 API
RebarUpdateCurvesData.GetHookOrientationAngle Method
 Get the hook orientation angle at end that is currently in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double GetHookOrientationAngle(
	int end
)
Public Function GetHookOrientationAngle (
	end As Integer
) As Double
public:
double GetHookOrientationAngle(
	int end
)
member GetHookOrientationAngle :
        end : int -> float
Parameters
end Int32
 The end of bar. Should be 0 for start or 1 for end.
Return Value
Double
 The hook orientation angle at end that is currently in the rebar.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Invalid end.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace